package 샘플;
//// 패키지명 : 클래스의 묵음.
//
///*주석공간 표시
//          Date : 2-23.08.14
//          Author: l.j.sung
//          porpose : 샘플 프로그램 입니다.
//          -주석의 종류 : 범위 주석(프로그램에 대한 설명을 기재해야 할 때, 협업자들과 미래의 나에게 설명.)
//                       / 주석내용 /
//                        한줄 주석  : //주석 내용
//    주석을 기록하는 이유 : - 컴파일러에게 해석을 하지 않아도 된다고 알려주는 것.
//                        - 협업자 혹은 미래의 나에게 설명하는 것.
//
// */
//
//
////접근제한자이며 모두 허용. class 앞에는 public이거나 생략하거나
//public class SampleClass {
//    public static void main(String[] args) {
//        //메소드에 대한 접근제한자는 public, protected, private, 아무것도 없는 defalut
//         // Statuc --> 정적변수, 메로리에 한번 컴파일되면 끝.
//         //void : 반환타입 , 반환 할 것이 없다는 뜻
//         // main : 진입 지점
//        // 진입지점(~~~ ) : 매개변수
//        System.out.println("샘플 프로그램을 작성 합니다.");
//        // print  :출력
//        //println : 줄바꿈으로 출력.
//    }
//}
//
////파이썬과 js에는 자료형이 없음.
